{
  "timestamp": "2025-07-29T23:15:34Z",
  "summary": "Started the day feeling somewhat better, but as pressure from office mounted—especially needing to stay up all night—the emotional weight returned sharply. Low sleep from last night worsened the mood. Midday brought a call from Tanvi from an unknown number after the longest breakup silence; the emotional manipulation and guilt triggered a sharp drop in stability. Switched off phone after cutting the call. Took SOS medication (likely Clonazepam) during a severe wave of suicidal ideation and panic. Post-medicine, experienced a wave of calm, along with a quiet realization that no escape or achievement will fundamentally remove the inner pain. Ended the day reflecting deeply on the nature of ongoing suffering and how to live with it without panic or resistance.",
  "status": {
    "moodLevel": "4",
    "sleepQuality": "3",
    "sleepDuration": "4",
    "energyLevel": "5",
    "stabilityScore": "2"
  },
  "insights": {
    "wins": [
      "Took SOS medication responsibly during acute distress",
      "Identified and resisted emotional manipulation from Tanvi",
      "Reached a grounded realization that pain is ongoing but manageable"
    ],
    "losses": [
      "Felt suicidal and emotionally overwhelmed in the middle of the day",
      "Tanvi’s call reopened emotional wounds",
      "Office pressure disrupted sleep and triggered mental instability"
    ],
    "ideas": [
      "Maybe it’s possible to build a small anchoring mechanism (not necessarily tech) that reminds me this pain is constant, but survivable",
      "Let go of the urge to engineer every insight—sometimes awareness is enough"
    ]
  },
  "goals": [
    "Stay functional during night work shift without collapsing into emotional spiral",
    "Avoid re-engaging emotionally with Tanvi for now"
  ],
  "tags": ["bipolar", "emotional spiral", "SOS medication", "Tanvi", "insight", "work pressure", "suicidal thoughts", "anchor thought"],
  "triggerEvents": [
    "Call from Tanvi after days of no contact",
    "Intense office workload with sleep deprivation"
  ],
  "symptomChecklist": [
    "Suicidal ideation",
    "Chest tightness / panic attack symptoms",
    "Mood whiplash",
    "Social withdrawal",
    "Overthinking / existential rumination",
    "Low emotional resilience"
  ]
}